# Usage: `brew bundle`

tap "adoptopenjdk/openjdk"
tap "github/gh"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "teamookla/speedtest"

# gnu utils
brew "coreutils"
brew "diffutils"
brew "moreutils"
brew "findutils"
brew "gawk"
brew "gnu-sed"
brew "gnu-tar"
brew "grep"

brew "awscli"
brew "bash"
brew "bat"
brew "bfg"
brew "direnv"
brew "fish"
brew "gh"
brew "git"
brew "git-delta"
brew "git-filter-repo"
brew "git-lfs"
brew "hr"
brew "htop"
brew "httpie"
brew "hub"
brew "imagemagick"
brew "jq"
brew "less"
brew "mas"
brew "node-build"
brew "nodenv"
brew "openssl"
brew "p7zip"
brew "python"
brew "readline"
brew "rename"
brew "shellcheck"
brew "shfmt"
brew "starship"
brew "stow"
brew "terminal-notifier"
brew "the_silver_searcher"
brew "thefuck"
brew "tree"
brew "wget"
brew "wifi-password"
brew "xz"
brew "yq"
brew "zsh"
brew "nodenv/nodenv/node-build-update-defs"
brew "nodenv/nodenv/nodenv-aliases"
brew "nodenv/nodenv/nodenv-default-packages"
brew "nodenv/nodenv/nodenv-each"
brew "teamookla/speedtest/speedtest"

# Install Applications
cask "1password-cli"
cask "aerial"
cask "alfred"
cask "appcleaner"
cask "balenaetcher"
cask "bartender"
cask "beardedspice"
cask "choosy"
cask "contexts"
cask "discord"
cask "displaperture"
cask "dropbox"
cask "firefox"
cask "google-chrome"
cask "gpg-suite-no-mail"
cask "iterm2"
cask "keyboard-cleaner"
cask "muzzle"
cask "ngrok"
cask "postico"
cask "postman"
cask "rectangle"
cask "scroll-reverser"
cask "spotify"
cask "transmission"
cask "ubersicht"
cask "visual-studio-code"
cask "vlc"
cask "xquartz"
cask "adoptopenjdk/openjdk/adoptopenjdk11"

# Music
# cask "kid3"
# cask "xld"

# Fonts
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-hasklig"
cask "font-source-code-pro"
cask "font-source-sans-pro"
cask "font-source-serif-pro"

# Install Mac App Store Applications
mas "1Password 7", id: 1333542190
mas "AdGuard for Safari", id: 1440147259
mas "Amphetamine", id: 937984704
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Slack", id: 803453959
mas "Spark", id: 1176895641
mas "Speedtest", id: 1153157709
mas "The Unarchiver", id: 425424353
# mas "Xcode", id: 497799835
