# Usage: `brew bundle`

brew "bash"
brew "bat"
brew "diff-so-fancy"
brew "direnv"
brew "fish"
brew "git-lfs"
brew "git"
brew "hr"
brew "httpie"
brew "hub"
brew "imagemagick"
brew "mas"
brew "node-build"
brew "node"
brew "nodenv"
brew "openssl"
brew "p7zip"
brew "python"
brew "rbenv"
brew "readline"
brew "redis"
brew "rename"
brew "ruby-build"
brew "terminal-notifier"
brew "the_silver_searcher"
brew "tree"
brew "wget", args: ["enable-iri"]
brew "wifi-password"

# Install Applications
cask "aerial"
cask "alfred"
cask "appcleaner"
cask "atom-beta"
cask "bartender"
cask "beardedspice"
cask "cheatsheet"
cask "discord"
cask "docker"
cask "dropbox"
cask "etcher"
cask "firefox"
cask "google-chrome"
cask "google-backup-and-sync"
cask "java"
cask "kap"
cask "karabiner-elements"
cask "keybase"
cask "keyboard-cleaner"
cask "kid3"
cask "lastpass"
cask "ngrok"
cask "postgres"
cask "postico"
cask "postman"
cask "resilio-sync"
cask "scroll-reverser"
cask "slack"
cask "spectacle"
cask "spotify"
cask "steam"
cask "transmission"
cask "transmit"
cask "ubersicht"
cask "unity-web-player"
cask "vlc"
cask "xld"
cask "xquartz"

# Install Mac App Store Applications
mas "Amphetamine", id: 937984704
mas "Growl", id: 467939042
mas "Keynote", id: 409183694
mas "Monit", id: 1014850245
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Speedtest", id: 1153157709
mas "Textual 7", id: 1262957439
mas "The Unarchiver", id: 425424353
# mas "Xcode", id: 497799835
