# Usage: `brew bundle`

tap "homebrew/cask-fonts"

brew "awscli"
brew "bash"
brew "bat"
brew "diff-so-fancy"
brew "direnv"
brew "fish"
brew "git-lfs"
brew "git"
brew "hr"
brew "httpie"
brew "hub"
brew "imagemagick"
brew "mas"
brew "node-build"
brew "nodenv"
brew "openssl"
brew "p7zip"
brew "python"
brew "python@2"
brew "rbenv"
brew "readline"
brew "redis"
brew "rename"
brew "ruby-build"
brew "shellcheck"
brew "terminal-notifier"
brew "the_silver_searcher"
brew "tree"
brew "wget"
brew "wifi-password"

# Install Applications
cask "aerial"
cask "alfred"
cask "appcleaner"
cask "bartender"
cask "beardedspice"
cask "discord"
cask "docker"
cask "dropbox"
cask "firefox"
cask "google-backup-and-sync"
cask "google-chrome"
cask "java"
cask "kap"
cask "keyboard-cleaner"
cask "postgres"
cask "postico"
cask "postman"
cask "spectacle"
cask "spotify"
cask "transmission"
cask "unity-web-player"
cask "visual-studio-code"
cask "vlc"
cask "xquartz"

# Music
# cask "kid3"
# cask "xld"

# Fonts
cask "font-fira-code"

# Install Mac App Store Applications
mas "1Password 7", id: 1333542190
mas "Amphetamine", id: 937984704
mas "Keynote", id: 409183694
mas "Monit", id: 1014850245
mas "Numbers", id: 409203825
mas "Okta Extension App", id: 1439967473
mas "Pages", id: 409201541
mas "Slack", id: 803453959
mas "Spark", id: 1176895641
mas "Speedtest", id: 1153157709
mas "Textual 7", id: 1262957439
mas "The Unarchiver", id: 425424353
# mas "Xcode", id: 497799835
