jethrokuan/z
jorgebucaran/autopair.fish
jorgebucaran/fisher
jorgebucaran/hydro
jorgebucaran/replay.fish
oh-my-fish/plugin-aws
oh-my-fish/plugin-osx
tough-griff/smartdot.fish
