cask_args appdir: "/Applications"

# Usage: `brew bundle`
tap "homebrew/bundle"
tap "homebrew/versions"

# Install GNU core utilities
# see zshrc GNU-utils
brew "coreutils"
brew "findutils"
brew "gawk"
brew "gnu-sed"
brew "moreutils"

# Install other useful binaries
brew "bash"
brew "direnv"
brew "diff-so-fancy"
brew "fasd"
brew "flow"
brew "ghi"
brew "git-lfs"
brew "git"
brew "gnupg"
brew "heroku-toolbelt"
brew "hr"
brew "httpie"
brew "hub"
brew "imagemagick"
brew "node-build"
brew "nodenv"
brew "openssl"
brew "p7zip"
brew "pound"
brew "python"
brew "rbenv"
brew "readline"
brew "redis"
brew "rename"
brew "ruby-build"
brew "terminal-notifier"
brew "the_silver_searcher"
brew "thefuck"
brew "tree"
brew "wget", args: ["enable-iri"]
brew "zsh-completions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"
brew "zsh"

cask "alfred"
cask "appcleaner"
cask "atom"
cask "bartender"
cask "beardedspice"
cask "bittorrent-sync"
cask "dropbox"
cask "firefox"
cask "google-drive"
cask "google-hangouts"
cask "hipchat"
cask "iterm2"
cask "keyboard-cleaner"
cask "near-lock"
cask "postgres"
cask "scroll-reverser"
cask "seil"
cask "slack"
cask "spectacle"
cask "transmission"
cask "transmit"
cask "ubersicht"
cask "vlc"
cask "xld"
cask "xquartz"
