# Usage: `brew bundle`
# `brew tap homebrew/bundle` if uninstalled
# `brew tap homebrew/versions` for phantomjs192

# Install GNU core utilities
# see zshrc GNU-utils
brew "coreutils"
brew "moreutils"
brew "findutils"
brew "gnu-sed"

# Install other useful binaries
brew "bash"
brew "casperjs"
brew "direnv"
brew "fasd"
brew "ghi"
brew "git"
brew "gnupg"
brew "heroku-toolbelt"
brew "hr"
brew "httpie"
brew "hub"
brew "node"
brew "openssl"
brew "p7zip"
brew "phantomjs192"
brew "pound"
brew "python"
brew "rbenv"
brew "readline"
brew "redis"
brew "rename"
brew "ruby-build"
brew "the_silver_searcher"
brew "thefuck"
brew "tree"
brew "wget", args: ["enable-iri"]
brew "zsh"
brew "zsh-completions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"
