# Usage: `brew bundle`
cask_args appdir: "/Applications"

tap "homebrew/bundle"
tap "homebrew/command-not-found"
tap "homebrew/versions"

# Install GNU core utilities
# see zshrc GNU-utils
brew "coreutils"
brew "binutils"
brew "findutils"
brew "moreutils"
brew "gawk"
brew "gnu-sed"
brew "gnu-tar"

# Install other useful binaries
brew "bash"
brew "diff-so-fancy"
brew "direnv"
brew "docker"
brew "docker-compose"
brew "docker-machine"
brew "fasd"
brew "flow"
brew "ghi"
brew "git-lfs"
brew "git"
brew "heroku-toolbelt"
brew "hr"
brew "httpie"
brew "hub"
brew "imagemagick"
brew "lastpass-cli", args: ["with-pinentry"]
brew "lesspipe", args: ["with-syntax-highlighting"]
brew "mas"
brew "node-build"
brew "nodenv"
brew "openssl"
brew "p7zip"
brew "pound"
brew "python"
brew "rbenv"
brew "readline"
brew "redis"
brew "rename"
brew "ruby-build"
brew "terminal-notifier"
brew "the_silver_searcher"
brew "thefuck"
brew "tree"
brew "wget", args: ["enable-iri"]
brew "wifi-password"
brew "zsh"
brew "zsh-completions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"

# Install Applications
cask "alfred"
cask "appcleaner"
cask "bartender"
cask "beardedspice"
cask "bittorrent-sync"
cask "cheatsheet"
cask "discord"
cask "dropbox"
cask "firefox"
cask "google-drive"
cask "google-hangouts"
cask "iterm2"
cask "keyboard-cleaner"
cask "licecap"
cask "lunchy"
cask "near-lock"
cask "postico"
cask "scroll-reverser"
cask "seil"
cask "spectacle"
cask "transmission"
cask "transmit"
cask "ubersicht"
cask "virtualbox"
cask "vlc"
cask "xld"
cask "xquartz"

# Install Mac App Store Applications
mas "Caffeine", id: 411246225
mas "Dash", id: 449589707
mas "Growl", id: 467939042
mas "Keynote", id: 409183694
mas "Monit", id: 1014850245
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Slack", id: 803453959
mas "The Unarchiver", id: 425424353
mas "Xcode", id: 497799835
