oh-my-fish/plugin-aws
edc/bass
oh-my-fish/plugin-direnv
barnybug/docker-fish-completion
fisherman/getopts
rominf/omf-plugin-hub
fisherman/nodenv
oh-my-fish/plugin-osx
tough-griff/pure-fish
fisherman/rbenv
fisherman/z
