barnybug/docker-fish-completion
edc/bass
fisherman/fishtape
fisherman/getopts
fisherman/z
oh-my-fish/plugin-aws
oh-my-fish/plugin-direnv
oh-my-fish/plugin-osx
rominf/omf-plugin-hub
~/GitHub/pure
