barnybug/docker-fish-completion
edc/bass
jethrokuan/z
jorgebucaran/fishopts
jorgebucaran/fishtape
oh-my-fish/plugin-aws
oh-my-fish/plugin-direnv
oh-my-fish/plugin-osx
rominf/omf-plugin-hub
tough-griff/pure
